# GROUP BY (DATA WRANGLING )

Groupby ka matlab jo jisse taloq rakhta ho uska ek group
ban jae .
FOR EXMAPLE :
we have data :: 
            
             Name  | Grade | Depart  | salaries
         ----------------------------------------   
           [ ubaid    16    accounts     1k   ]
           [ atif     17    accounts     2k   ]
           [ furqan   18    info         3k   ]
           [ ali      19    taxtion      4k   ]
           [ rehan    16    accounts     3k   ]
           [ nasir    17    taxtion      4k   ]
           [ samad    15    info         3k   ]
           [ saad     19    defence      2k   ] 
           
           
NOW WE DO GROUP BY :
                      
                  |  ubaid  16  1k
          Account |  rehan  16  3k
                  |  atif   17  2k
      ---------------------------------
      
           Tax    |  Nasir  17  4k
                  |  ali    19  4k
      ---------------------------------
      
          info    |  furqan  18  3k
                  |  samad   15  3k
      ---------------------------------

In [1]:
import numpy as np
import pandas as pd

In [7]:
data = pd.read_excel("groups.xlsx",sheet_name=1)

In [8]:
data

      Names  Grades        Depts  Salaries
0      Asad      16     Accounts        100
1     Fahad      17     Taxation        123
2     Saima      18     Accounts        121
3    Afzal       19     Taxation         98
4    Yasir       16  Information         99
5    Nasir       19     Defence         100
6   Husain       14     Accounts        123
7   Hassan       17  Information        122
8      Jami      17     Defence         156
9     Haseb      18     Accounts        160
10    Ahmed      16     Accounts        456

In [10]:
data.Depts.unique()
# note defence me space he ise khatam karna huga .

array(['Accounts', 'Taxation', 'Information', 'Defence '], dtype=object)

In [17]:
# khatam karne ka tariqa .
data.Depts = data.Depts.apply(lambda x: x.strip())

0        Accounts
1        Taxation
2        Accounts
3        Taxation
4     Information
5         Defence
6        Accounts
7     Information
8         Defence
9        Accounts
10       Accounts
Name: Depts, dtype: object

In [21]:
data.Depts = data.Depts.apply(lambda x: x.strip())

In [22]:
# ab space khatam lambda ki help se
data.Depts.unique()

array(['Accounts', 'Taxation', 'Information', 'Defence'], dtype=object)

In [12]:
taxt=data[data.Depts=="Taxation"]
taxt

    Names  Grades     Depts  Salaries
1   Fahad      17  Taxation        123
3  Afzal       19  Taxation         98

In [13]:
Depart=data[data.Depts=="Accounts"]
Depart

      Names  Grades     Depts  Salaries
0      Asad      16  Accounts        100
2     Saima      18  Accounts        121
6   Husain       14  Accounts        123
9     Haseb      18  Accounts        160
10    Ahmed      16  Accounts        456

In [14]:
info=data[data.Depts=="Information"]
info

     Names  Grades        Depts  Salaries
4   Yasir       16  Information         99
7  Hassan       17  Information        122

In [23]:
defence = data[data.Depts=="Defence"]
defence

    Names  Grades    Depts  Salaries
5  Nasir       19  Defence        100
8    Jami      17  Defence        156

In [25]:
# data ko group by karna 
data.groupby("Depts")
#group by hu gaya he laken result nahi aya

In [26]:
# result lane ka tariqa
# groupby karne ke bad hame aggregate funtion ka used karna huta he 
data.groupby("Depts").groups
# ab ya hame bata raha heke kis group me kitne valuse he
# matlab ke index number bata raha  he ke ya number wale isme shamil he

{'Accounts': [0, 2, 6, 9, 10], 'Defence': [5, 8], 'Information': [4, 7], 'Taxation': [1, 3]}

In [27]:
# aghar muja koi group chaheya ho
data.groupby("Depts").get_group("Accounts")

      Names  Grades     Depts  Salaries
0      Asad      16  Accounts        100
2     Saima      18  Accounts        121
6   Husain       14  Accounts        123
9     Haseb      18  Accounts        160
10    Ahmed      16  Accounts        456

In [28]:
# aghar bar bar process repeset nai karna huto 
gb = data.groupby("Depts")

In [31]:
gb.get_group("Information")

     Names  Grades        Depts  Salaries
4   Yasir       16  Information         99
7  Hassan       17  Information        122

In [32]:
# Error is leya aya he q ke  salaries me space aya he data ke under 
gb.get_group("Information")["salaries"]

KeyError: 'salaries'

In [33]:
# now fix this Error
#isme hum pehle columns me ghae or kaha ke salaries space wale ko esa kardo
#yani ke bagheer space ke kardo [before "salaries " after "salaries"]
# inplace true ka matlab data ka jo sheet he usse parmenet change hu jae
data.rename(columns={"Salaries ": "Salaries"}, inplace=True)

In [35]:
# fix error 
gb.get_group("Information")["Salaries"]
#isme ab bata raha he ke 4 index wale ka selery itna he or 7 wale ka itna

4     99
7    122
Name: Salaries, dtype: int64

In [37]:
# ab hum grades par group lete hen
# sub se pehle grades group ko name dena huga 
gb_grades = data.groupby("Grades")

In [44]:
data.Grades.unique()

array([16, 17, 18, 19, 14], dtype=int64)

In [40]:
# Grades me jo 16 grade ke hw who nikal aegha
gb_grades.get_group(16)

     Names  Grades        Depts  Salaries
0     Asad      16     Accounts       100
4   Yasir       16  Information        99
10   Ahmed      16     Accounts       456

In [45]:
gb_grades.groups

{14: [6], 16: [0, 4, 10], 17: [1, 7, 8], 18: [2, 9], 19: [3, 5]}

###  working on data

In [2]:
import numpy as np
import pandas as pd

In [3]:
url1 = "https://raw.githubusercontent.com/FBosler/Medium-Data-Exploration/master/order_leads.csv"
url2 = "https://raw.githubusercontent.com/FBosler/Medium-Data-Exploration/master/sales_team.csv"
order_leads = pd.read_csv(url1, parse_dates=[3])
                          # [3] ka matlab he index 3 columns ka

In [4]:
order_leads.head()

,Order Id,Company Id,Company Name,Date,Order Value,Converted
0,HZSXLI1IS9RGABZW,D0AUXPP07H6AVSGD,Melancholy Social-Role,2017-10-13,6952,0
1,582WPS3OW8T6YT0R,D0AUXPP07H6AVSGD,Melancholy Social-Role,2017-09-02,7930,0
2,KRF65MQZBOYG4Y9T,D0AUXPP07H6AVSGD,Melancholy Social-Role,2016-12-21,5538,1
3,N3EDZ5V1WGSWW828,D0AUXPP07H6AVSGD,Melancholy Social-Role,2018-06-03,1113,0
4,QXBC8COXEXGFSPLP,D0AUXPP07H6AVSGD,Melancholy Social-Role,2014-07-26,4596,0

In [5]:
sale_team = pd.read_csv(url2)
sale_team

,Sales Rep,Sales Rep Id,Company Name,Company Id
0,William Taylor,ZTZA0ZLYZR85PTUJ,Melancholy Social-Role,D0AUXPP07H6AVSGD
1,William Taylor,ZTZA0ZLYZR85PTUJ,Pee-Wee Pigeon,TJW99R4RWH02INII
2,William Taylor,ZTZA0ZLYZR85PTUJ,Vaginal 36-Year-Old,3S20IO1O1DYXMUNU
3,William Taylor,ZTZA0ZLYZR85PTUJ,Unhurried Musician'S,FDWW0TQRPGMVI2A7
4,William Taylor,ZTZA0ZLYZR85PTUJ,Comprehensive Lists,C30FY83UNLVBA0O3
...,...,...,...,...
4614,Ida Woodward,LF3CPWWZKSNB1AXI,Unauthorized Increases,654ZMAXSV11BOMMI
4615,Ida Woodward,LF3CPWWZKSNB1AXI,Atom-Like Principle,42AO6UOXN0GXVHFQ
4616,Ida Woodward,LF3CPWWZKSNB1AXI,Congratulatory Economist,4B714VS0FWLGBSMU
4617,Ida Woodward,LF3CPWWZKSNB1AXI,Readable Pilots,G4D892KB5W0UCPR4
4618,Ida Woodward,LF3CPWWZKSNB1AXI,Trade-Preparatory Quarterbacks,APH243SK72T90MPS

In [6]:
#  kon kon se name he company me .
order_leads["Company Name"].unique()

array(['Melancholy Social-Role', 'Pee-Wee Pigeon', 'Vaginal 36-Year-Old',
       ..., 'Congratulatory Economist', 'Readable Pilots',
       'Trade-Preparatory Quarterbacks'], dtype=object)

In [7]:
# info ya batae gha kis ki typse kiya he .
order_leads.info()
#  object ka matlab string he .
# info me humnne dekha ke date ki type srting nahi he jo ke masla bna sakta he
#    hum esey (date) me convert karte . jahan humne data ka name deya tha
#   order_leads = pd.read_csv(url1, parse_dates=[3])
                          # [3] ka matlab he index 3 columns ka

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 6 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Order Id      100000 non-null  object
 1   Company Id    100000 non-null  object
 2   Company Name  100000 non-null  object
 3   Date          100000 non-null  datetime64[ns]
 4   Order Value   100000 non-null  int64
 5   Converted     100000 non-null  int64
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 4.6+ MB

In [8]:
# order_lead ka shape  se hame pata chale gha ke data kitna bara he 
# isme [100000] ka matlab rows he [6] ka matlab columns .
order_leads.shape

(100000, 6)

In [9]:
# pehle humne falto columns ko khatam ki uske (axix 1 me humne columns ka kaha he)
#  warna bydefult who rows samajta he
order_leads.drop("Company Id", inplace=True, axis = 1)

In [10]:
order_leads.duplicated().sum()

0

In [ ]:
# ya bhi date time me convert karne ke leya he
order_leads["Date"] = pd.to_datetime(order_leads["Date"])

In [11]:
order_leads.isna().sum()

Order Id        0
Company Name    0
Date            0
Order Value     0
Converted       0
dtype: int64

In [12]:
sale_team.head(10)

        Sales Rep      Sales Rep Id            Company Name        Company Id
0  William Taylor  ZTZA0ZLYZR85PTUJ  Melancholy Social-Role  D0AUXPP07H6AVSGD
1  William Taylor  ZTZA0ZLYZR85PTUJ          Pee-Wee Pigeon  TJW99R4RWH02INII
2  William Taylor  ZTZA0ZLYZR85PTUJ     Vaginal 36-Year-Old  3S20IO1O1DYXMUNU
3  William Taylor  ZTZA0ZLYZR85PTUJ    Unhurried Musician'S  FDWW0TQRPGMVI2A7
4  William Taylor  ZTZA0ZLYZR85PTUJ     Comprehensive Lists  C30FY83UNLVBA0O3
5  William Taylor  ZTZA0ZLYZR85PTUJ         Off-Beat Anthea  6NHGP9YC7CTBARBG
6  William Taylor  ZTZA0ZLYZR85PTUJ    Pearl-Gray Midstream  JSG0N4TPIDMQOR4A
7  William Taylor  ZTZA0ZLYZR85PTUJ    Unaggressive Quality  AJ4EWVZKZGX0KBC9
8  William Taylor  ZTZA0ZLYZR85PTUJ    Astral Circumference  ZVKRKS0N8FAMWU8C
9  William Taylor  ZTZA0ZLYZR85PTUJ      Greasy Transitions  CLSTQXCAABBWSQ8K

In [13]:
sale_team.drop("Company Id", inplace= True , axis=1)

In [17]:
sale_team.columns

Index(['Sales Rep', 'Sales Rep Id', 'Company Name'], dtype='object')

In [18]:
sale_team["Company Name"].unique()

array(['Melancholy Social-Role', 'Pee-Wee Pigeon', 'Vaginal 36-Year-Old',
       ..., 'Congratulatory Economist', 'Readable Pilots',
       'Trade-Preparatory Quarterbacks'], dtype=object)

In [19]:
sale_team.shape

(4619, 3)

In [20]:
sale_team.duplicated().sum()

0

In [21]:
sale_team.isna().sum()

Sales Rep       0
Sales Rep Id    0
Company Name    0
dtype: int64

## now mapping both data

In [22]:
# frist data
order_leads.head(5)

           Order Id            Company Name       Date  Order Value  Converted
0  HZSXLI1IS9RGABZW  Melancholy Social-Role 2017-10-13         6952          0
1  582WPS3OW8T6YT0R  Melancholy Social-Role 2017-09-02         7930          0
2  KRF65MQZBOYG4Y9T  Melancholy Social-Role 2016-12-21         5538          1
3  N3EDZ5V1WGSWW828  Melancholy Social-Role 2018-06-03         1113          0
4  QXBC8COXEXGFSPLP  Melancholy Social-Role 2014-07-26         4596          0

In [23]:
# second data
sale_team.head(5)

        Sales Rep      Sales Rep Id            Company Name
0  William Taylor  ZTZA0ZLYZR85PTUJ  Melancholy Social-Role
1  William Taylor  ZTZA0ZLYZR85PTUJ          Pee-Wee Pigeon
2  William Taylor  ZTZA0ZLYZR85PTUJ     Vaginal 36-Year-Old
3  William Taylor  ZTZA0ZLYZR85PTUJ    Unhurried Musician'S
4  William Taylor  ZTZA0ZLYZR85PTUJ     Comprehensive Lists

In [24]:
# on ka matlab kispe merge karna he
data = order_leads.merge(sale_team , on = ["Company Name"] )
data.head(5)

,Order Id,Company Name,Date,Order Value,Converted,Sales Rep,Sales Rep Id
0,HZSXLI1IS9RGABZW,Melancholy Social-Role,2017-10-13,6952,0,William Taylor,ZTZA0ZLYZR85PTUJ
1,582WPS3OW8T6YT0R,Melancholy Social-Role,2017-09-02,7930,0,William Taylor,ZTZA0ZLYZR85PTUJ
2,KRF65MQZBOYG4Y9T,Melancholy Social-Role,2016-12-21,5538,1,William Taylor,ZTZA0ZLYZR85PTUJ
3,N3EDZ5V1WGSWW828,Melancholy Social-Role,2018-06-03,1113,0,William Taylor,ZTZA0ZLYZR85PTUJ
4,QXBC8COXEXGFSPLP,Melancholy Social-Role,2014-07-26,4596,0,William Taylor,ZTZA0ZLYZR85PTUJ

In [25]:
# new columns banane ke leya .
data = data[["Company Name","Order Id","Order Value","Date","Sales Rep","Sales Rep Id","Converted"]]
data.head(5)

,Company Name,Order Id,Order Value,Date,Sales Rep,Sales Rep Id,Converted
0,Melancholy Social-Role,HZSXLI1IS9RGABZW,6952,2017-10-13,William Taylor,ZTZA0ZLYZR85PTUJ,0
1,Melancholy Social-Role,582WPS3OW8T6YT0R,7930,2017-09-02,William Taylor,ZTZA0ZLYZR85PTUJ,0
2,Melancholy Social-Role,KRF65MQZBOYG4Y9T,5538,2016-12-21,William Taylor,ZTZA0ZLYZR85PTUJ,1
3,Melancholy Social-Role,N3EDZ5V1WGSWW828,1113,2018-06-03,William Taylor,ZTZA0ZLYZR85PTUJ,0
4,Melancholy Social-Role,QXBC8COXEXGFSPLP,4596,2014-07-26,William Taylor,ZTZA0ZLYZR85PTUJ,0

In [26]:
data.shape

(100000, 7)

In [27]:
data.groupby("Company Name")

In [28]:
data["Company Name"].unique()

array(['Melancholy Social-Role', 'Pee-Wee Pigeon', 'Vaginal 36-Year-Old',
       ..., 'Congratulatory Economist', 'Readable Pilots',
       'Trade-Preparatory Quarterbacks'], dtype=object)

###  Task = kis company ne kitna sale ki or height's sales kis ki he

In [29]:
company_group = data.groupby("Company Name")

In [30]:
# (1) kis company ne kitna sale ki 
data.groupby("Company Name")["Converted"].sum()

Company Name
'Nough Demolition          8
1/50Th Stipulation         2
10-Hour Bestseller         6
10-Team Formats            1
10-Year Presentation       4
                          ..
York-Mind Bod/Day/1,000    0
York-Mind Titan            5
Youngest Fund              3
Zaporogian Shapes          5
Zodiacal Indigation        3
Name: Converted, Length: 4619, dtype: int64

In [31]:
# (2)  heights kon he sel me
data.groupby("Company Name")["Converted"].sum().max()

16

In [32]:
# sub se zeyada sels kiska he 
#  ascendind ka matlab bara or desicending ka matlab chota
data.groupby("Company Name")["Converted"].sum().sort_values(ascending=False)
# aghar sub se kam ka nikalna hu to ( ( False ) ki jgha( True ) kardo)

Company Name
Canny Pompousness                     16
Particularistic-Seeming Frog-Haiku    14
Eighty-Fifth Aviv                     13
Minor Targets                         11
Sickly Phosphate                      11
                                      ..
Unnourished Not-Ace                    0
Disobedient Loosli                     0
Inclusive Council'S                    0
Anthropological Chandler'S             0
Undreamt Crucifixion                   0
Name: Converted, Length: 4619, dtype: int64

In [33]:
# aghar muja index number janna ho zeyada ya kam ka
data.groupby("Company Name")["Converted"].sum().sort_values(ascending=False).index[0]

'Canny Pompousness'

'Nough Demolition ( is company ka recode )

In [34]:
data[data["Company Name"]=="'Nough Demolition"]

,Company Name,Order Id,Order Value,Date,Sales Rep,Sales Rep Id,Converted
17923,'Nough Demolition,2HP1PFFSHNM9LAMP,3204,2016-03-06,Clarissa Harvey,XPBDN8KC3CIFPNPP,0
17924,'Nough Demolition,KVV381A5VNMT6AHY,5950,2018-10-01,Clarissa Harvey,XPBDN8KC3CIFPNPP,0
17925,'Nough Demolition,2IDW4N4J9RY19N6G,3659,2017-06-19,Clarissa Harvey,XPBDN8KC3CIFPNPP,0
17926,'Nough Demolition,DU817NJ44X9K4XHY,7279,2016-01-06,Clarissa Harvey,XPBDN8KC3CIFPNPP,1
17927,'Nough Demolition,1QATDSTN8DD5IUU1,5248,2015-07-12,Clarissa Harvey,XPBDN8KC3CIFPNPP,0
17928,'Nough Demolition,L5NQ1KS62PRG5Q9X,3505,2014-10-16,Clarissa Harvey,XPBDN8KC3CIFPNPP,0
17929,'Nough Demolition,A5EDKTOV58UY61A1,3930,2017-02-12,Clarissa Harvey,XPBDN8KC3CIFPNPP,0
17930,'Nough Demolition,NO1JIQ9ACEDL1TGN,4677,2016-09-27,Clarissa Harvey,XPBDN8KC3CIFPNPP,1
17931,'Nough Demolition,84ULDC9Y20LITKHY,5327,2015-10-02,Clarissa Harvey,XPBDN8KC3CIFPNPP,1
17932,'Nough Demolition,6J7GZIQQ01KVH1HC,213,2018-05-11,Clarissa Harvey,XPBDN8KC3CIFPNPP,1
17933,'Nough Demolition,L6WZDPI4FSNKLO5W,7710,2014-04-30,Clarissa Harvey,XPBDN8KC3CIFPNPP,0
17934,'Nough Demolition,AVJTOVXO8GSJ7EHI,6121,2018-11-15,Clarissa Harvey,XPBDN8KC3CIFPNPP,0
17935,'Nough Demolition,DWZKEY3QZF4VNEFL,1897,2017-04-06,Clarissa Harvey,XPBDN8KC3CIFPNPP,0
17936,'Nough Demolition,K16HYXSA7T2DA8OP,1924,2016-03-22,Clarissa Harvey,XPBDN8KC3CIFPNPP,0
17937,'Nough Demolition,MQBTNMLUYIECFJHO,7896,2017-03-14,Clarissa Harvey,XPBDN8KC3CIFPNPP,0
17938,'Nough Demolition,9DZU3JFZFBZ084NK,8315,2014-08-09,Clarissa Harvey,XPBDN8KC3CIFPNPP,0
17939,'Nough Demolition,EIXDK1NO1HQTYBT7,5902,2015-03-19,Clarissa Harvey,XPBDN8KC3CIFPNPP,1
17940,'Nough Demolition,9R0SHG4LI32J497Q,3624,2016-04-21,Clarissa Harvey,XPBDN8KC3CIFPNPP,0
17941,'Nough Demolition,T2URY83AVLI4UKJL,8838,2015-08-08,Clarissa Harvey,XPBDN8KC3CIFPNPP,1
17942,'Nough Demolition,TMGBWI63ZA9QQORZ,1040,2014-02-26,Clarissa Harvey,XPBDN8KC3CIFPNPP,0
17943,'Nough Demolition,EQR1RUATS1Q0T540,6725,2018-01-30,Clarissa Harvey,XPBDN8KC3CIFPNPP,0
17944,'Nough Demolition,WZZG5PACT17SZVCY,7119,2017-04-04,Clarissa Harvey,XPBDN8KC3CIFPNPP,0
17945,'Nough Demolition,GR37T8AT8TWIAQ2J,5544,2018-03-10,Clarissa Harvey,XPBDN8KC3CIFPNPP,0
17946,'Nough Demolition,GSJYRP4LYYUQ70ZJ,4584,2014-12-21,Clarissa Harvey,XPBDN8KC3CIFPNPP,0
17947,'Nough Demolition,IHPD932F3JWGAIKP,5014,2016-11-11,Clarissa Harvey,XPBDN8KC3CIFPNPP,1
17948,'Nough Demolition,LJ4QDCZOM8MQGNQM,8200,2018-05-12,Clarissa Harvey,XPBDN8KC3CIFPNPP,0
17949,'Nough Demolition,CQ0FADIRVIXDCY8K,8626,2017-04-29,Clarissa Harvey,XPBDN8KC3CIFPNPP,0
17950,'Nough Demolition,O63D92H6VA15CI0N,8806,2016-06-28,Clarissa Harvey,XPBDN8KC3CIFPNPP,1
17951,'Nough Demolition,M6P4AIC1VGFV0FJD,7322,2015-02-10,Clarissa Harvey,XPBDN8KC3CIFPNPP,0
17952,'Nough Demolition,ASOSWRDTXC94FEPM,3999,2017-01-31,Clarissa Harvey,XPBDN8KC3CIFPNPP,0
17953,'Nough Demolition,366SQOTCS4Y5AWA5,8408,2017-04-11,Clarissa Harvey,XPBDN8KC3CIFPNPP,0

In [35]:
# isse ya andaza huta heke ( 1 = 8 ) he or baqi sub ( 0 = 23)) or 31 data he 
data[data["Company Name"]=="'Nough Demolition"].shape

(31, 7)

In [37]:
# aghar sahi se dekha jae 31 ka matlab to ya he .
company_group.get_group("'Nough Demolition")["Converted"].value_counts()

Converted
0    23
1     8
Name: count, dtype: int64

 kis / kitne  company ne koi bhi sales nahi ki

In [38]:
# 133 company ne koi sales nahi ki
nikammi_company = data.groupby("Company Name")["Converted"].sum().sort_values(ascending = True)
nikammi_company[nikammi_company==0].size

133

## part 2 start

In [39]:
data.head(5)

,Company Name,Order Id,Order Value,Date,Sales Rep,Sales Rep Id,Converted
0,Melancholy Social-Role,HZSXLI1IS9RGABZW,6952,2017-10-13,William Taylor,ZTZA0ZLYZR85PTUJ,0
1,Melancholy Social-Role,582WPS3OW8T6YT0R,7930,2017-09-02,William Taylor,ZTZA0ZLYZR85PTUJ,0
2,Melancholy Social-Role,KRF65MQZBOYG4Y9T,5538,2016-12-21,William Taylor,ZTZA0ZLYZR85PTUJ,1
3,Melancholy Social-Role,N3EDZ5V1WGSWW828,1113,2018-06-03,William Taylor,ZTZA0ZLYZR85PTUJ,0
4,Melancholy Social-Role,QXBC8COXEXGFSPLP,4596,2014-07-26,William Taylor,ZTZA0ZLYZR85PTUJ,0

In [57]:
data.groupby("Company Name")["Order Value"].sum()

Company Name
'Nough Demolition          170606
1/50Th Stipulation         103917
10-Hour Bestseller         126331
10-Team Formats            102651
10-Year Presentation        90579
                            ...
York-Mind Bod/Day/1,000     73085
York-Mind Titan             96402
Youngest Fund               68182
Zaporogian Shapes           85793
Zodiacal Indigation         90633
Name: Order Value, Length: 4619, dtype: int64

 kis comapny ne hights amount sel ki he

In [67]:
# isme 0 or 1 ko alagh alagh karke company ka group by karke print deya
# take pata chal sake is company ne kitna sale ki or kitna nahi
data.groupby(["Company Name","Converted"])["Order Value"].sum()

Company Name         Converted
'Nough Demolition    0            124550
                     1             46056
1/50Th Stipulation   0             94313
                     1              9604
10-Hour Bestseller   0            104000
                                   ...
Youngest Fund        1              8887
Zaporogian Shapes    0             64381
                     1             21412
Zodiacal Indigation  0             64852
                     1             25781
Name: Order Value, Length: 9105, dtype: int64

In [68]:
# siraf 1 ka data
data[data.Converted==1]

,Company Name,Order Id,Order Value,Date,Sales Rep,Sales Rep Id,Converted
2,Melancholy Social-Role,KRF65MQZBOYG4Y9T,5538,2016-12-21,William Taylor,ZTZA0ZLYZR85PTUJ,1
7,Melancholy Social-Role,JFMNRRRNS5MD8BKQ,8349,2018-02-27,William Taylor,ZTZA0ZLYZR85PTUJ,1
13,Melancholy Social-Role,TD5F4GJ2LPIJMIM7,913,2018-07-03,William Taylor,ZTZA0ZLYZR85PTUJ,1
14,Melancholy Social-Role,A96YQNYAU7Z9AM70,516,2015-07-05,William Taylor,ZTZA0ZLYZR85PTUJ,1
16,Melancholy Social-Role,5WNCKI809TG9M568,5370,2017-07-09,William Taylor,ZTZA0ZLYZR85PTUJ,1
...,...,...,...,...,...,...,...
99986,Trade-Preparatory Quarterbacks,FLLDB4PNB0Z3CSCM,1293,2017-06-09,Ida Woodward,LF3CPWWZKSNB1AXI,1
99990,Trade-Preparatory Quarterbacks,I2M8DEJSX9D8956T,9539,2014-11-16,Ida Woodward,LF3CPWWZKSNB1AXI,1
99992,Trade-Preparatory Quarterbacks,VDI6DV3GWK1JCAJM,178,2017-04-18,Ida Woodward,LF3CPWWZKSNB1AXI,1
99994,Trade-Preparatory Quarterbacks,L95YJURYBYPKLS5Q,9359,2018-05-19,Ida Woodward,LF3CPWWZKSNB1AXI,1
99996,Trade-Preparatory Quarterbacks,962CSDMAJ49E0CRK,442,2018-08-02,Ida Woodward,LF3CPWWZKSNB1AXI,1

In [80]:
# isme 1 ka sum nikal ke de raha he order value ka 
data[data.Converted==1].groupby("Company Name")["Order Value"].sum()
# logic : 
#        data me gaya converted ko 1 ke barabar keya
#        comapny ka groub keya order values par 
#        company me jo order value the 1 ke ba rabar uska sum huwa 
#         or data print.

Company Name
'Nough Demolition       46056
1/50Th Stipulation       9604
10-Hour Bestseller      22331
10-Team Formats          9880
10-Year Presentation    15827
                        ...
Yellow Perplexity       23999
York-Mind Titan         32263
Youngest Fund            8887
Zaporogian Shapes       21412
Zodiacal Indigation     25781
Name: Order Value, Length: 4486, dtype: int64

In [78]:
#  ya who sum kar raha he jo order value 1 ke barar he or us 1 me
#  jo bhi order value me a raha he un sab ka sum de raha he
data[data.Converted==1].groupby("Company Name")["Order Value"].sum().sort_values(ascending=False)

Company Name
Canny Pompousness                     86675
Hydrostatic Amazement                 76128
Particularistic-Seeming Frog-Haiku    69869
Out-Of-Bounds Pacers                  66744
Gullible Referral                     63670
                                      ...
Bombastic A/3                           134
Devout Accenting                        123
Fine-Chiseled Ghent                     108
Criminal Densmore                       105
Phony Calcium                           104
Name: Order Value, Length: 4486, dtype: int64

In [133]:
data.Converted.value_counts()

Converted
0    83092
1    16908
Name: count, dtype: int64

In [138]:
data.groupby("Converted").get_group(0).head(2)

,Company Name,Order Id,Order Value,Date,Sales Rep,Sales Rep Id,Converted
0,Melancholy Social-Role,HZSXLI1IS9RGABZW,6952,2017-10-13,William Taylor,ZTZA0ZLYZR85PTUJ,0
1,Melancholy Social-Role,582WPS3OW8T6YT0R,7930,2017-09-02,William Taylor,ZTZA0ZLYZR85PTUJ,0

In [ ]:
Sales

In [77]:
#   ya order value ka max de raha he
data[data.Converted==1].groupby("Company Name")["Order Value"].sum().max()

86675

In [92]:
# index me hame batae gha ke 1 se lekar 3 ka company ka name aega
data[data.Converted==1].groupby("Company Name")["Order Value"].sum().sort_values(ascending=False).index[0:3]

Index(['Canny Pompousness', 'Hydrostatic Amazement',
       'Particularistic-Seeming Frog-Haiku'],
      dtype='object', name='Company Name')

In [94]:
# ya company name or usma sum nikal ke de raha he
data[data.Converted==1].groupby("Company Name")["Order Value"].sum().sort_values(ascending=False)[0:1]

Company Name
Canny Pompousness    86675
Name: Order Value, dtype: int64

In [129]:
data[data.Converted==1].max()

Company Name    Zodiacal Indigation
Order Id           ZZXC29Y2HWXZ1MJR
Order Value                    9999
Date            2018-12-31 00:00:00
Sales Rep            Yvonne Lindsey
Sales Rep Id       ZTZA0ZLYZR85PTUJ
Converted                         1
dtype: object

In [114]:
# company me sub se heigh sels
data.groupby(["Company Name","Converted"])["Order Value"].sum().max()
#  ya data ka  sare values ko sum kar raha he

186425

In [131]:
data["Sales Rep"].value_counts()

Sales Rep
Jessica Renner      430
Alyssa Mckinney     428
Elizabeth Gaddy     416
Susan Gutierrez     415
Georgiann White     413
                   ...
Viola Ates           18
Debra Vermillion     17
Alfredo Weise        17
Simon Hearn          15
Robert Bowen         15
Name: count, Length: 499, dtype: int64

RANDOM DATA FRAME

In [145]:
random = pd.DataFrame(np.random.random((2,4)),columns=list("abcd"))
random

          a         b         c         d
0  0.556726  0.906428  0.651947  0.499588
1  0.554739  0.240306  0.189437  0.313988

In [146]:
random.apply(sum, axis=1)

0    2.614689
1    1.298469
dtype: float64

In [154]:
def div(x):
    return round(x,3)
random.apply(lambda x : round(x,3),axis=1)

       a      b      c      d
0  0.557  0.906  0.652  0.500
1  0.555  0.240  0.189  0.314

In [148]:
div(0.556726)

0.557

 GROUP BY ME AGREEGATION

Agreegation me sal ka sum nikalna

In [159]:
# Grouper hamare leya khuch chezey provide karta he jesey [key] or[ freq]
# ya time seleris me chalta ya help karta he define karne ke leya
data.groupby(pd.Grouper(key="Date",freq="Y"))["Order Value"].apply(sum)

Date
2014-12-31    100422394
2015-12-31    101724648
2016-12-31    101789642
2017-12-31    101957784
2018-12-31    100399962
Freq: A-DEC, Name: Order Value, dtype: int64